# Направете програма за размяна стойностите на две променливи във вариант различен от двата варианта, направени в час.

#################################################################################
# По-сложен вариант, където всъщност се презаписват стойностите на предния скрипт
print("Това е програма, която сменя стойностите на две променливи. Ще трябва да въведете двете стойности по отделно")
X = input("Въведе стойност за Х: ")
Y = input("Въведе стойност за Y: ")
mid_value = X
X = Y
Y = mid_value
print("Разменените стойности са X=", X,"Y=", Y)