# Да се пресметне рекурсивно средната стойност на елементите в контейнер.

# Дефинираме функция:
def my_sum(L):
    if not L:       # Граничен случай когато L е празен списък, булевата му стойност е 0,
        return 0    # Комбинирано с 'not' - резултата става булева 1-ца
    else:           
        return L[0] + my_sum(L[1:])  # Тук е важно да отбележим,че този 1: индекс реже списъка от втория елемент нататък
                                    # Това се комбинира с рекурсията, която третира целия output, като този втори списък
                                    # И така рекурсията на рекурсията ще "реже" по един елемент, докато не свършат елементите
    
# Пробваме функцията със зададен списък от числа:
L = [12, 53, 23, 87, 2, 1, 65, 32, 54, 96, 32, 19, 46]
print(my_sum(L))