# Ако е даден речника D,да се напише програма, която съставя нов речник M с ключове „под 1500 лева“ и „над 1500 лева“.
# Стойностите на новия речник са речници с елементи от речника D, които отговарят на условието за под и над 1500 лева.
###################################################################################################
D={"смартфон":1257.99 , "лаптоп":3059.00, "компютър":659.00, "таблет":1759.00,"телевизор": 1075.00}

below = {}
above = {}

for i, item in enumerate(D.items()):
    if item[1] < 1500:
        below[item[0]] = item[1]
    if item[1] > 1500:
        above[item[0]] = item[1]

M = {"под 1500": below, "над 1500": above}
print(M)