# Създайте функция, която да извлича координатите на избран град и създайте възможност потребителят да въведе град и да получи координатите му.

cities_dict = {"Paris" : {"latitude": 48.8566, "longitude": 2.3522},
               "Tokyo" : {"latitude": 35.6895, "longitude": 139.6917},
               "New York" : {"latitude": 40.7128, "longitude": -74.0060}
               }

def coord_query(query):
    return cities_dict.get(query) # Метода .get() проверява дали аргумента е ключ в речника и ако е връща съответната стойност

print("Налични градове:", str(cities_dict.keys())[11:-2])
print(coord_query(input("Въведете името на наличен град, за да получите координатите му: ")))