# УСЛОВИЕ
# Напишете програма, която приема две редици – с имена на артикули и техния търговски рейтинг 
# (напр. "компютър", "лаптоп", "таблет", "смартфон") и (44.5, 66.9, 39.7, 73.8)),
# превръща редиците в речник {"артикул": рейтинг} и подрежда  речника по рейтинг, от най-продавани към по-малко продавани артикули. 
# Помислете предварително как да направите подреждане по стойностите в речника,
# след като по принцип може да се прави подреждане (sorted()) по ключове.
#############################################################################

# Зареждаме редиците, като понеже нямам време ще ползвам готовите

item = ("компютър", "лаптоп", "таблет", "смартфон")
rating = (44.5, 66.9, 39.7, 73.8)
my_dict = {}

# Създаване на речника
if len(item) == len(rating): # NB: Тук е важна проверката, тъй като иначе стойности или ключове ще останат самички
    for i in range(len(item)):
        my_dict[item[i]] = rating[i]
    
    # Сортираме my_dict по стойностите в нарастващ ред. Функцията sorted() връща списък от редици, като взема елементите от my_dict.items().
    # Използваме lambda функция като ключ (key=lambda item: item[1]), която указва, че сортирането трябва да се извърши по стойността в речника.
    # Резултатът от sorted() се го вкарваме в dict(), за да се преобразува обратно в речник, но този път подреден по стойностите.
    # ПС: Това го взех от интернет, а срока за предаване е след 5 минути, така че ще трябва да преглътнем, че не съм го учил ;D
    sorted_dict = dict(sorted(my_dict.items(), key=lambda item: item[1]))

    # Извеждаме резулататите докато сме още в цикъла
    print("Неподреден реник: ", my_dict)
    print("Подреден речник: ", sorted_dict)
else:
    print("Внимание, зададените редици не са с еднаква дължина и е възможно стойностите им да се изгубят.\n ! Моля рестартирайте програмата !")