# Да се направи подробен коментар към скриптовете на приложените задачи.

########################################################################
# Задача: Ако е дадена парола съдържаща латински букви и цифри, да се
# направи конвертор, който заменя латинските букви с български и цифрите
# както следва:
# 1=и
# 2=д
# 3=е
# 4=ч
# 5=п
# 6=ш
# 7=т
# 8=ъ
# 9=щ
# 0=о
# @=а
# !=л
# Изведете получената дума.

# Дефиниране на буквите от A до Z в ASCII таблицата
AZ = ''.join([chr(i) for i in range(ord('A'), ord('Z')+1)])

# Дефиниране на буквите от a до z в ASCII таблицата
az = ''.join([chr(i) for i in range(ord('a'), ord('z')+1)])

# Дефиниране на цифрите от 0 до 9 в ASCII таблицата
num = [chr(i) for i in range(ord('0'), ord('9')+1)]

# Добавяне на специалните символи @ и ! към списъка с цифрите
num.extend(['@', '!'])

# Обединяване на всички символи в един стринг
num = ''.join(num)

# Дефиниране на символите, с които ще се заменят цифрите и буквите
numcod = ''.join(['о', 'и', 'д', 'е', 'ч', 'п', 'ш', 'т', 'ъ', 'щ', 'а', 'л'])

# Дефиниране на българските букви от А до Я
BG = ''.join([chr(i) for i in range(ord('А'), ord('Я')+1)])
BG = BG[:26]

# Дефиниране на българските букви от а до я
bg = ''.join([chr(i) for i in range(ord('а'), ord('я')+1)])
bg = bg[:26]

# Потребителят въвежда парола, съдържаща латински букви и цифри
str_input = input('Моля, въведете парола, написана на латиница и с цифри: ')

# Инициализация на променлива за новата парола
new_password = ''

# Заместване на всеки символ от въведената парола със съответстващия български символ
for char in str_input:
    k_AZ = AZ.find(char)  # Търсене на символа в горния регистър на латинските букви
    k_az = az.find(char)  # Търсене на символа в долния регистър на латинските букви
    k_num = num.find(char)  # Търсене на символа в списъка с цифрите и специалните символи

    # Заместване на латинските букви с българските
    if k_AZ != -1:
        str_input = str_input.replace(char, BG[k_AZ])
    elif k_az != -1:
        str_input = str_input.replace(char, bg[k_az])
    
    # Заместване на цифрите и специалните символи със съответстващите им български символи
    elif k_num != -1:
        str_input = str_input.replace(char, numcod[k_num])

# Извеждане на новата парола
print("Новата парола е: " + str_input)