# Направете try/except конструкция за въвеждане на цяло число от клавиатурата, като ако не сме въвели цяло число да има подходящо съобщение в клаузата except.
while True:
    try:
        number = int(input("Въведете цяло число: ")) # проверка става, като въведения стринг се конвертира интежер
        break
    except ValueError:
        print("Въведете коректно цяло число!")
    # Към горната задача добавете клаузата finally и сложете извеждане на съобщението “въвеждането приключи”.
    finally:
        print("Въвеждането приключи.")