# Програма, която иска да се въведат 10 числа в диапазона [1:30] и показва множеството на въведените числа и множеството на повторките по отделно

L = [] # Списък с всички числа
D = [] # Списък с повторките

print("Числата, които въвеждате трябва да са в диапазона [1:30]\n")
for i in range(10):
    num = int(input(f"Въведете {i+1} число: "))
    
    # Първия подцикъл добавя повторките в техния списък
    if num in L: 
        D.append(num)
    
    # Втория подцикъл постоянно проверява дали въведеното число е в желаното множество
    while num < 1 or num > 30:
        num = int(input(f"{num} =/= в диапазона [1:30]. Въведете ново число: "))
    L.append(num)
    
# Готови сме да принтираме резултатите, като за да избегнем повторки превръщаме списъците в множества
print("\nВсички числа, които сте въвели поне веднъж са:\n", set(L))
print("\nВсички числа, които сте въвели повече от веднъж са:\n", set(D))