# Направете стринг от числа в интервала [1,20], разделени със запетая. Броят на числата да е в интервала[5,15]. 
# Като използвате  метода .count() намерете и отпечатайте колко пъти се среща всяко число от 1 до 20 в стринга.

######################################################################
#Програма която изписва в стринг въведените числа числа от потребителя
l = []
n = 5 # брой числа между [5 : 15]
print(f"Въведи {n} числа в интервала [1:20]")
for i in range(n):
    num = int(input(f"Въведи {i+1} число: "))
    if int(num)<1 or int(num)>20:
        num = int(input(f"{num} =/= в интервала от [1:20]"))
    l.append(str(num))
print(", ".join(l))