# Предложете поне два варианта на програма, която да принтира в обратен ред въведено число.
my_list = []

original_num = input("Въведете число за изписване в обратен ред: ")
for i in range(len(original_num)-1, -1, -1): # За да върви в обратен ред почваме от дължината на числото - 1 (поради индексирането от 0 в py),
    my_list.append(original_num[i])          #  стигаме до -1, което значи че ще обхванем последното число и стъпката с която се движим е -1 защото е в нисходящ ред

reversed_num = "".join(my_list)
print(reversed_num)